## Practice on DataFrames !

In [2]:
import pandas as pd

In [4]:
p1 = pd.Series({'Name':'Udit',
               'Age': 20, 
               'Gender' : 'Male'})
p2 = pd.Series({'Name': 'Light',
               'Age':21, 
               'Gender': 'Male'})
df = pd.DataFrame([p1, p2], index = ['Real', 'Fictional'])
df

            Name  Age Gender
Real        Udit   20   Male
Fictional  Light   21   Male

In [6]:
df.loc['Real']

Name      Udit
Age         20
Gender    Male
Name: Real, dtype: object

In [7]:
df.iloc[0]

Name      Udit
Age         20
Gender    Male
Name: Real, dtype: object

In [8]:
print(type(df.loc['Fictional']), type(df.iloc[1]))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

In [9]:
df['Name']

Real          Udit
Fictional    Light
Name: Name, dtype: object

In [10]:
df['Age']

Real         20
Fictional    21
Name: Age, dtype: int64

In [11]:
df.loc['Real', 'Name']

'Udit'

In [12]:
df.loc['Fictional', 'Name']

'Light'

In [21]:
# diff. index can have same name
p1 = pd.Series({'Name':'Udit',
               'Age': 20, 
               'Gender' : 'Male'})
p2 = pd.Series({'Name': 'Light',
               'Age':21, 
               'Gender': 'Male'})
p3 = pd.Series({'Name': 'Omega',
               'Age':25, 
               'Gender': 'Male'})

df = pd.DataFrame([p1, p2, p3], index = ['Real', 'Fictional', 'Fictional'])
df

            Name  Age Gender
Real        Udit   20   Male
Fictional  Light   21   Male
Fictional  Omega   25   Male

In [22]:
df.loc['Fictional']

            Name  Age Gender
Fictional  Light   21   Male
Fictional  Omega   25   Male

In [23]:
# Transpose
df.T

        Real Fictional Fictional
Name    Udit     Light     Omega
Age       20        21        25
Gender  Male      Male      Male

In [24]:
# Chaining is slower than comma seperated because it returns a copy of the 
# object rather than view. Better to avoid!
df.loc['Fictional']['Name']

Fictional    Light
Fictional    Omega
Name: Name, dtype: object

In [25]:
df.loc[:, ['Name', 'Age']]

            Name  Age
Real        Udit   20
Fictional  Light   21
Fictional  Omega   25

## To drop data in DataFrames.
returns a copy of dataframe with selected row removed!!

In [28]:
df.drop('Real')

            Name  Age Gender
Fictional  Light   21   Male
Fictional  Omega   25   Male

In [30]:
df

            Name  Age Gender
Real        Udit   20   Male
Fictional  Light   21   Male
Fictional  Omega   25   Male

In [29]:
df.drop('Fictional')

      Name  Age Gender
Real  Udit   20   Male

In [31]:
df

            Name  Age Gender
Real        Udit   20   Male
Fictional  Light   21   Male
Fictional  Omega   25   Male

In [43]:
# Making copy,, just like in py code
df_copy = df.copy()
df_copy

            Name  Age Gender
Real        Udit   20   Male
Fictional  Light   21   Male
Fictional  Omega   25   Male

In [47]:
df_copy = df_copy.drop('Real')
df_copy

            Name  Age Gender
Fictional  Light   21   Male
Fictional  Omega   25   Male

In [53]:
df_copy = df.copy()
del df_copy['Name']
df_copy

           Age Gender
Real        20   Male
Fictional   21   Male
Fictional   25   Male

In [55]:
df['Speciality'] = 'Speedkill'
df

            Name  Age Gender Speciality
Real        Udit   20   Male  Speedkill
Fictional  Light   21   Male  Speedkill
Fictional  Omega   25   Male  Speedkill